ERPDeveloper3.РасчетЦены/src/InformationRegisters/УчетЦенНоменклатуры/УчетЦенНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension" extendedConfigurationObject="fc58ded6-6ab7-4275-85fa-9e029095e031">
  <name>УчетЦенНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <informationRegisterPeriodicity>Day</informationRegisterPeriodicity>
  <writeMode>RecorderSubordinate</writeMode>
  <resources extendedConfigurationObject="9b955e2b-b3d7-462b-b1f9-7fafd2f3bb8a">
    <name>Цена</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <dimensions extendedConfigurationObject="bad95542-06ad-4716-b31a-3a9735e85bf3">
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </dimensions>
</mdclass:InformationRegister>

ERPDeveloper3.РасчетЦены/src/InformationRegisters/УчетЦенНоменклатуры/ManagerModule.bsl
Функция ПолучитьЦенуНоменклатуры(Номенклатура) Экспорт
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ
		|	УчетЦенНоменклатурыСрезПоследних.Цена КАК Цена
		|ИЗ
		|	РегистрСведений.УчетЦенНоменклатуры.СрезПоследних(, Номенклатура = &Номенклатура) КАК УчетЦенНоменклатурыСрезПоследних";
	
	Запрос.УстановитьПараметр("Номенклатура", Номенклатура);
	
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда	
		Возврат 0;	
	КонецЕсли;
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();
	
	Возврат ВыборкаДетальныеЗаписи.Цена;
КонецФункции // ПолучитьЦенуНоменклатуры
